# **Data Exploration and Understanding:**

Let us Explore the Data and understand DataFrame in Three Levels:



1.   Working With Entire DataFrame
2.   Working With Columns
3.   Working with Rows
4.   Working With Cells.

In [ ]:
# import required Libraries
import pandas as pd

In [ ]:
df = pd.read_csv('/content/Student_Responses.csv')

In [ ]:
df.head()

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA

In [ ]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER', 'HOMETOWN',
       'HIGHEST QUALIFICATION', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS'],
      dtype='object')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Timestamp              31 non-null     object
 1   NAME                   31 non-null     object
 2   BATCH NUMBER           31 non-null     int64
 3   HOMETOWN               31 non-null     object
 4   HIGHEST QUALIFICATION  31 non-null     object
 5   FIELD OF STUDY         31 non-null     object
 6   COURSE REGISTERED      31 non-null     object
 7   IT EXPERIENCE          31 non-null     int64
 8   SALARY EXPECTATIONS    31 non-null     object
dtypes: int64(2), object(7)
memory usage: 2.3+ KB

# **Working With Whole DataFrame:**

1. **Undestanding Data Frame Structure:**

            (a) df.info()
            (b) df.describe()
            (c) df.head(n)
            (d) df.tail(n)
            (f) df.isnull.sum()
            (g) df.sample(n)

In [ ]:
df.describe()

       BATCH NUMBER  IT EXPERIENCE
count     31.000000      31.000000
mean     396.451613       0.419355
std        0.505879       1.310832
min      396.000000       0.000000
25%      396.000000       0.000000
50%      396.000000       0.000000
75%      397.000000       0.000000
max      397.000000       6.000000

In [ ]:
df.describe(include='all')

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
count,31,31,31.000000,31,31,31,31,31.000000,31
unique,31,30,NaN,26,19,25,1,NaN,25
top,6/27/2025 9:03:07,Chelikani Harshini,NaN,Hyderabad,B.Tech,CSE,Data Science,NaN,8 LPA
freq,1,2,NaN,4,6,3,31,NaN,3
mean,NaN,NaN,396.451613,NaN,NaN,NaN,NaN,0.419355,NaN
std,NaN,NaN,0.505879,NaN,NaN,NaN,NaN,1.310832,NaN
min,NaN,NaN,396.000000,NaN,NaN,NaN,NaN,0.000000,NaN
25%,NaN,NaN,396.000000,NaN,NaN,NaN,NaN,0.000000,NaN
50%,NaN,NaN,396.000000,NaN,NaN,NaN,NaN,0.000000,NaN
75%,NaN,NaN,397.000000,NaN,NaN,NaN,NaN,0.000000,NaN
max,NaN,NaN,397.000000,NaN,NaN,NaN,NaN,6.000000,NaN

In [ ]:
df.describe(include=object)

,Timestamp,NAME,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,SALARY EXPECTATIONS
count,31,31,31,31,31,31,31
unique,31,30,26,19,25,1,25
top,6/27/2025 9:03:07,Chelikani Harshini,Hyderabad,B.Tech,CSE,Data Science,8 LPA
freq,1,2,4,6,3,31,3

In [ ]:
# checking for missing values
df.isnull().sum()

Timestamp                0
NAME                     0
BATCH NUMBER             0
HOMETOWN                 0
HIGHEST QUALIFICATION    0
FIELD OF STUDY           0
COURSE REGISTERED        0
IT EXPERIENCE            0
SALARY EXPECTATIONS      0
dtype: int64

In [ ]:
df

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
7,6/27/2025 9:05:20,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6
8,6/27/2025 9:05:44,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa
9,6/27/2025 9:05:46,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA
11,6/27/2025 9:06:07,KARLAPATI VENKATA JAYAVARDHAN,396,MADHIRA,DEGREE,BA.PROGRAMME,Data Science,0,8 LPA
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa
14,6/27/2025 9:06:44,M.Abhilash Naik,397,Narasaraopeta,BTech,EEE,Data Science,0,5 to 6 LPA
15,6/27/2025 9:06:59,mayank kumar singh,397,kirandul,b.com in buisness analytics,commerce,Data Science,0,5-8lpa
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA
18,6/27/2025 9:07:56,Akurala Harshitha,397,Hanamkonda,B.Tech,Data Science,Data Science,0,5-6 LPA
19,6/27/2025 9:08:04,Kattela Harshitha,397,Sangareddy,BTech,Computer Science and Data Science,Data Science,0,6 lakhs
20,6/27/2025 9:08:15,Naga Srinu Kala,396,Rajamundry,B.sc,B.sc Computer science,Data Science,0,5 - 6 LPA
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000
22,6/27/2025 9:08:50,Nishith T,396,Warangal,BTECH,COMPUTER SCIENCE AND ENGINEERING,Data Science,0,10-12
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA
24,6/27/2025 9:09:25,k uday kiran,396,kakinada,bsc(meiot),no,Data Science,0,5lp
25,6/27/2025 9:09:56,ETYALA MAHESH,396,Karimnagar,B.tech,Mining,Data Science,0,6 lpa
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa
27,6/27/2025 9:10:08,Sravani Errolla,396,"mupkal, nizamabad",bachelor of degree,computer science,Data Science,0,10 LPA Basic
28,6/27/2025 9:10:30,sai,396,Hyderabad,b.tech,information technology,Data Science,0,25 lpa
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA

In [ ]:
df['NAME']

0                           Ashruth
1                     Chithari Ravi
2                    Ajay Erumalla
3                       Rushikanth
4                       VAMPU MANAS
5                    D SAI SHREYAS
6                Chelikani Harshini
7                   Yedeedya Injeti
8               venkatesh nalagarla
9                   Chiluka Suvarna
10                   Reddymasu Teja
11    KARLAPATI VENKATA JAYAVARDHAN
12          vishnu Durga doddipatla
13                    Priya Dakhore
14                 M.Abhilash Naik
15               mayank kumar singh
16               Chelikani Harshini
17               MANDE UDAY SHANKAR
18                Akurala Harshitha
19                Kattela Harshitha
20                  Naga Srinu Kala
21            MANTRI VAMSHI KRISHNA
22                        Nishith T
23                    SAI SHREYAS D
24                     k uday kiran
25                   ETYALA MAHESH
26               Nagineni Tejaswini
27                  Sravani Errolla
28                              sai
29                    Mahesh kuamar
30                  JETTI PRANITHA
Name: NAME, dtype: object

In [ ]:
df['NAME'].isnull().sum()

np.int64(0)

In [ ]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER', 'HOMETOWN',
       'HIGHEST QUALIFICATION', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS'],
      dtype='object')

In [ ]:
df.sample(10)

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa

# **2. Data Frame Non Indexing Attributes:**

          (a) x=df.axes
          (b) df.dtypes
          (c) df.empty
          (d) df.ndim
          (e) df.shape
          (f) df.size
          (g) df.values
          (h) df2=df.T
          (i) df.shape, df.shape[0], df.shape[1]
          (j) df.columns

In [ ]:
# Code Here
x = df.axes

In [ ]:
x[0]

RangeIndex(start=0, stop=31, step=1)

In [ ]:
x[1]

Index(['Timestamp', 'NAME', 'BATCH NUMBER', 'HOMETOWN',
       'HIGHEST QUALIFICATION', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS'],
      dtype='object')

In [ ]:
df.shape

(31, 9)

In [ ]:
df.shape[0]

31

In [ ]:
df.shape[1]

9

In [ ]:
df.dtypes

Timestamp                object
NAME                     object
BATCH NUMBER              int64
HOMETOWN                 object
HIGHEST QUALIFICATION    object
FIELD OF STUDY           object
COURSE REGISTERED        object
IT EXPERIENCE             int64
SALARY EXPECTATIONS      object
dtype: object

In [ ]:
df.empty

False

In [ ]:
df.ndim

2

In [ ]:
df.size # 31 rows * 9 columns

279

In [ ]:
31*9 # 31 rows, 9 columns

279

In [ ]:
df.values

array([['6/27/2025 9:03:07', 'Ashruth', 396, 'Kamareddy',
        'Under graduate', 'Computer science engineering', 'Data Science',
        0, '4-6'],
       ['6/27/2025 9:03:25', 'Chithari Ravi', 397, 'Hyderabad', 'Btech',
        'Computer Science', 'Data Science', 6,
        'As per the market standards'],
       ['6/27/2025 9:03:32', 'Ajay Erumalla ', 397, 'Siddipet ',
        'B.Tech', 'Computer Science and Engineering ', 'Data Science', 0,
        '5 - 6 LPA'],
       ['6/27/2025 9:03:45', 'Rushikanth ', 396, 'Vijayawada ', 'Btech ',
        'ECE', 'Data Science', 0, '4 lpa'],
       ['6/27/2025 9:03:50', 'VAMPU MANAS', 397, 'BHONGIR', 'BTECH',
        'ECE', 'Data Science', 0, '5 LPA'],
       ['6/27/2025 9:04:10', 'D SAI SHREYAS ', 396, 'HYDERABAD',
        'B.TECH', 'INFORMATION TECHNOLOGY', 'Data Science', 0, '6 LPA'],
       ['6/27/2025 9:04:47', 'Chelikani Harshini', 397, 'Hyderabad',
        'BTech', 'Computer Science and Engineering', 'Data Science', 0,
        '5LPA'],
       ['6/27/2025 9:05:20', 'Yedeedya Injeti', 397, 'Amalapuram',
        'B.Tech', 'CSE', 'Data Science', 0, '5-6'],
       ['6/27/2025 9:05:44', 'venkatesh nalagarla', 397, 'nellore',
        'MCA', 'computer science', 'Data Science', 0, '5-6 lpa'],
       ['6/27/2025 9:05:46', 'Chiluka Suvarna', 396, 'Hyderabad',
        'B.Tech', 'computer science & engineering', 'Data Science', 0,
        '6 lpa'],
       ['6/27/2025 9:05:50', 'Reddymasu Teja', 396,
        'Andhra pradesh,Prakasam(dist),Darsi', 'B-Tech', 'CSE',
        'Data Science', 0, '8 LPA'],
       ['6/27/2025 9:06:07', 'KARLAPATI VENKATA JAYAVARDHAN', 396,
        'MADHIRA', 'DEGREE', 'BA.PROGRAMME', 'Data Science', 0, '8 LPA'],
       ['6/27/2025 9:06:29', 'vishnu Durga doddipatla', 396, 'kakinada',
        'B.tech', 'Computer Science', 'Data Science', 0, '5 lpa'],
       ['6/27/2025 9:06:31', 'Priya Dakhore', 397,
        'Amravati,Maharashtra', 'Bachelors Degree',
        'Information Technology', 'Data Science', 1, '7lpa'],
       ['6/27/2025 9:06:44', 'M.Abhilash Naik ', 397, 'Narasaraopeta ',
        'BTech ', 'EEE', 'Data Science', 0, '5 to 6 LPA'],
       ['6/27/2025 9:06:59', 'mayank kumar singh', 397, 'kirandul',
        'b.com in buisness analytics', 'commerce', 'Data Science', 0,
        '5-8lpa'],
       ['6/27/2025 9:07:28', 'Chelikani Harshini', 397, 'Hyderabad',
        'BTech', 'Computer Science and Engineering', 'Data Science', 0,
        '5LPA'],
       ['6/27/2025 9:07:40', 'MANDE UDAY SHANKAR', 396,
        'RAMAYAPATNAM IN AP', 'B.TECH', 'DATA SCIENCE', 'Data Science',
        0, '8 LPA'],
       ['6/27/2025 9:07:56', 'Akurala Harshitha', 397, 'Hanamkonda ',
        'B.Tech', 'Data Science ', 'Data Science', 0, '5-6 LPA'],
       ['6/27/2025 9:08:04', 'Kattela Harshitha', 397, 'Sangareddy',
        'BTech', 'Computer Science and Data Science', 'Data Science', 0,
        '6 lakhs'],
       ['6/27/2025 9:08:15', 'Naga Srinu Kala', 396, 'Rajamundry',
        'B.sc', 'B.sc Computer science ', 'Data Science', 0, '5 - 6 LPA'],
       ['6/27/2025 9:08:19', 'MANTRI VAMSHI KRISHNA', 396, 'HYDERABAD ',
        'MBA', 'MBA Finance', 'Data Science', 4, '2500000'],
       ['6/27/2025 9:08:50', 'Nishith T', 396, 'Warangal', 'BTECH',
        'COMPUTER SCIENCE AND ENGINEERING ', 'Data Science', 0, '10-12'],
       ['6/27/2025 9:09:02', 'SAI SHREYAS D', 396, 'HYDERABAD', 'B.TECH',
        'INFORMATION TECHNOLOGY ', 'Data Science', 0, '44 LPA'],
       ['6/27/2025 9:09:25', 'k uday kiran', 396, 'kakinada',
        'bsc(meiot)', 'no', 'Data Science', 0, '5lp'],
       ['6/27/2025 9:09:56', 'ETYALA MAHESH ', 396, 'Karimnagar ',
        'B.tech', 'Mining ', 'Data Science', 0, '6 lpa'],
       ['6/27/2025 9:10:01', 'Nagineni Tejaswini', 397,
        'Rajampet,Annamayya district,Andhra Pradesh', 'B.Tech',
        'Computer Science and Artificial Intelligence', 'Data Science',
        0, '5-6lpa'],
       ['6/27/2025 9:10:08', 'Sravani Errolla', 396, 'mupkal, nizamabad',
        'bachelor of degree', 'computer science', 'Data Science', 0,
        '10 LPA Basic'],
       ['6/27/2025 9:10:30', 'sai', 396, 'Hyderabad ', 'b.tech',
        'information technology ', 'Data Science', 0, '25 lpa'],
       ['6/27/2025 9:10:45', 'Mahesh kuamar', 396, 'Guntur', 'Btech',
        'CSE', 'Data Science', 2, '10LPA'],
       ['6/27/2025 9:11:03', 'JETTI PRANITHA ', 397, 'Kodad', 'B.Tech',
        'Computer Science and DataScience ', 'Data Science', 0, '6 LPA']],
      dtype=object)

In [ ]:
df2 = df.T
df2

,0,1,2,3,4,5,6,7,8,9,...,21,22,23,24,25,26,27,28,29,30
Timestamp,6/27/2025 9:03:07,6/27/2025 9:03:25,6/27/2025 9:03:32,6/27/2025 9:03:45,6/27/2025 9:03:50,6/27/2025 9:04:10,6/27/2025 9:04:47,6/27/2025 9:05:20,6/27/2025 9:05:44,6/27/2025 9:05:46,...,6/27/2025 9:08:19,6/27/2025 9:08:50,6/27/2025 9:09:02,6/27/2025 9:09:25,6/27/2025 9:09:56,6/27/2025 9:10:01,6/27/2025 9:10:08,6/27/2025 9:10:30,6/27/2025 9:10:45,6/27/2025 9:11:03
NAME,Ashruth,Chithari Ravi,Ajay Erumalla,Rushikanth,VAMPU MANAS,D SAI SHREYAS,Chelikani Harshini,Yedeedya Injeti,venkatesh nalagarla,Chiluka Suvarna,...,MANTRI VAMSHI KRISHNA,Nishith T,SAI SHREYAS D,k uday kiran,ETYALA MAHESH,Nagineni Tejaswini,Sravani Errolla,sai,Mahesh kuamar,JETTI PRANITHA
BATCH NUMBER,396,397,397,396,397,396,397,397,397,396,...,396,396,396,396,396,397,396,396,396,397
HOMETOWN,Kamareddy,Hyderabad,Siddipet,Vijayawada,BHONGIR,HYDERABAD,Hyderabad,Amalapuram,nellore,Hyderabad,...,HYDERABAD,Warangal,HYDERABAD,kakinada,Karimnagar,"Rajampet,Annamayya district,Andhra Pradesh","mupkal, nizamabad",Hyderabad,Guntur,Kodad
HIGHEST QUALIFICATION,Under graduate,Btech,B.Tech,Btech,BTECH,B.TECH,BTech,B.Tech,MCA,B.Tech,...,MBA,BTECH,B.TECH,bsc(meiot),B.tech,B.Tech,bachelor of degree,b.tech,Btech,B.Tech
FIELD OF STUDY,Computer science engineering,Computer Science,Computer Science and Engineering,ECE,ECE,INFORMATION TECHNOLOGY,Computer Science and Engineering,CSE,computer science,computer science & engineering,...,MBA Finance,COMPUTER SCIENCE AND ENGINEERING,INFORMATION TECHNOLOGY,no,Mining,Computer Science and Artificial Intelligence,computer science,information technology,CSE,Computer Science and DataScience
COURSE REGISTERED,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,...,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science,Data Science
IT EXPERIENCE,0,6,0,0,0,0,0,0,0,0,...,4,0,0,0,0,0,0,0,2,0
SALARY EXPECTATIONS,4-6,As per the market standards,5 - 6 LPA,4 lpa,5 LPA,6 LPA,5LPA,5-6,5-6 lpa,6 lpa,...,2500000,10-12,44 LPA,5lp,6 lpa,5-6lpa,10 LPA Basic,25 lpa,10LPA,6 LPA

## 3. **Data Frame Utility Methods:**

            (a) df.copy()
            (b) df.rank()
            (c) df.sort_values(by=col) or by=[col1,col2]
            (d) df.sort_index()

             Will discuss in next notebook

| Method      | Description                                               | Example Ranks (for \[80, 95, 95, 70]) |
| ----------- | --------------------------------------------------------- | ------------------------------------- |
| `'average'` | (Default) Assign average of the ranks to tied values      | `[2.0, 3.5, 3.5, 1.0]`                |
| `'min'`     | Assign **lowest** possible rank to all tied values        | `[2.0, 3.0, 3.0, 1.0]`                |
| `'max'`     | Assign **highest** possible rank to all tied values       | `[2.0, 4.0, 4.0, 1.0]`                |
| `'first'`   | Assign ranks in the **order values appear**, even if tied | `[2.0, 3.0, 4.0, 1.0]`                |
| `'dense'`   | Like `min`, but ranks go up by 1 (no gaps)                | `[2.0, 3.0, 3.0, 1.0]`                |

In [ ]:
df2 = df.copy()

In [ ]:
df2

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
7,6/27/2025 9:05:20,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6
8,6/27/2025 9:05:44,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa
9,6/27/2025 9:05:46,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA
11,6/27/2025 9:06:07,KARLAPATI VENKATA JAYAVARDHAN,396,MADHIRA,DEGREE,BA.PROGRAMME,Data Science,0,8 LPA
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa
14,6/27/2025 9:06:44,M.Abhilash Naik,397,Narasaraopeta,BTech,EEE,Data Science,0,5 to 6 LPA
15,6/27/2025 9:06:59,mayank kumar singh,397,kirandul,b.com in buisness analytics,commerce,Data Science,0,5-8lpa
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA
18,6/27/2025 9:07:56,Akurala Harshitha,397,Hanamkonda,B.Tech,Data Science,Data Science,0,5-6 LPA
19,6/27/2025 9:08:04,Kattela Harshitha,397,Sangareddy,BTech,Computer Science and Data Science,Data Science,0,6 lakhs
20,6/27/2025 9:08:15,Naga Srinu Kala,396,Rajamundry,B.sc,B.sc Computer science,Data Science,0,5 - 6 LPA
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000
22,6/27/2025 9:08:50,Nishith T,396,Warangal,BTECH,COMPUTER SCIENCE AND ENGINEERING,Data Science,0,10-12
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA
24,6/27/2025 9:09:25,k uday kiran,396,kakinada,bsc(meiot),no,Data Science,0,5lp
25,6/27/2025 9:09:56,ETYALA MAHESH,396,Karimnagar,B.tech,Mining,Data Science,0,6 lpa
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa
27,6/27/2025 9:10:08,Sravani Errolla,396,"mupkal, nizamabad",bachelor of degree,computer science,Data Science,0,10 LPA Basic
28,6/27/2025 9:10:30,sai,396,Hyderabad,b.tech,information technology,Data Science,0,25 lpa
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA

In [ ]:
df2['names'] = 5 # add new column with value 5 in dataframe

In [ ]:
df2

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,names
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,5
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,5
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA,5
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa,5
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA,5
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA,5
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA,5
7,6/27/2025 9:05:20,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6,5
8,6/27/2025 9:05:44,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa,5
9,6/27/2025 9:05:46,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa,5
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA,5
11,6/27/2025 9:06:07,KARLAPATI VENKATA JAYAVARDHAN,396,MADHIRA,DEGREE,BA.PROGRAMME,Data Science,0,8 LPA,5
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa,5
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa,5
14,6/27/2025 9:06:44,M.Abhilash Naik,397,Narasaraopeta,BTech,EEE,Data Science,0,5 to 6 LPA,5
15,6/27/2025 9:06:59,mayank kumar singh,397,kirandul,b.com in buisness analytics,commerce,Data Science,0,5-8lpa,5
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA,5
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA,5
18,6/27/2025 9:07:56,Akurala Harshitha,397,Hanamkonda,B.Tech,Data Science,Data Science,0,5-6 LPA,5
19,6/27/2025 9:08:04,Kattela Harshitha,397,Sangareddy,BTech,Computer Science and Data Science,Data Science,0,6 lakhs,5
20,6/27/2025 9:08:15,Naga Srinu Kala,396,Rajamundry,B.sc,B.sc Computer science,Data Science,0,5 - 6 LPA,5
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000,5
22,6/27/2025 9:08:50,Nishith T,396,Warangal,BTECH,COMPUTER SCIENCE AND ENGINEERING,Data Science,0,10-12,5
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA,5
24,6/27/2025 9:09:25,k uday kiran,396,kakinada,bsc(meiot),no,Data Science,0,5lp,5
25,6/27/2025 9:09:56,ETYALA MAHESH,396,Karimnagar,B.tech,Mining,Data Science,0,6 lpa,5
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa,5
27,6/27/2025 9:10:08,Sravani Errolla,396,"mupkal, nizamabad",bachelor of degree,computer science,Data Science,0,10 LPA Basic,5
28,6/27/2025 9:10:30,sai,396,Hyderabad,b.tech,information technology,Data Science,0,25 lpa,5
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA,5
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA,5

In [ ]:
df.head(3)

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA

# **4. Data Frame Iteration Methods:**

          (a) df.iterrows()---> row wise iteration
          (b) df.items()---> column wise iteration

          Will discuss in next notebook

# **5. Maths on Whole Data Frame:**

        (a) df = df.abs() # absolute values
        (b) df = df.add(o) # add df, Series or value
        (c) s = df.count() # non NA/null values
        (g) df = df.diff() # 1st diff (col def axis)
        (h) df = df.div(o) # div by df, Series, value
        (i) s = df.max() # max of axis (col def)
        (j) s = df.mean() # mean (col default axis)
        (k) s = df.median() # median (col default)
        (l) s = df.min() # min of axis (col def)
        (m) df = df.mul(o) # mul by df Series val
        (n) s = df.sum() # sum axis (cols default)
        (o) df = df.where(df > 0.5, other=np.nan)

In [ ]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER', 'HOMETOWN',
       'HIGHEST QUALIFICATION', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS'],
      dtype='object')

In [ ]:
df['IT EXPERIENCE'].abs()    # negative values it will convert to positive

0     0
1     6
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    1
14    0
15    0
16    0
17    0
18    0
19    0
20    0
21    4
22    0
23    0
24    0
25    0
26    0
27    0
28    0
29    2
30    0
Name: IT EXPERIENCE, dtype: int64

In [ ]:
abs(-5)

5

In [ ]:
df['IT EXPERIENCE'].add(2)

0     2
1     8
2     2
3     2
4     2
5     2
6     2
7     2
8     2
9     2
10    2
11    2
12    2
13    3
14    2
15    2
16    2
17    2
18    2
19    2
20    2
21    6
22    2
23    2
24    2
25    2
26    2
27    2
28    2
29    4
30    2
Name: IT EXPERIENCE, dtype: int64

In [ ]:
df['IT EXPERIENCE']

0     0
1     6
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    1
14    0
15    0
16    0
17    0
18    0
19    0
20    0
21    4
22    0
23    0
24    0
25    0
26    0
27    0
28    0
29    2
30    0
Name: IT EXPERIENCE, dtype: int64

In [ ]:
df['IT EXPERIENCE'].count()

np.int64(31)

In [ ]:
df.count()

Timestamp                31
NAME                     31
BATCH NUMBER             31
HOMETOWN                 31
HIGHEST QUALIFICATION    31
FIELD OF STUDY           31
COURSE REGISTERED        31
IT EXPERIENCE            31
SALARY EXPECTATIONS      31
dtype: int64

In [ ]:
df['IT EXPERIENCE'].diff() # current row - previous row value

0     NaN
1     NaN
2     0.0
3    -6.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     0.0
10    0.0
11    0.0
12    0.0
13    1.0
14    0.0
15   -1.0
16    0.0
17    0.0
18    0.0
19    0.0
20    0.0
21    4.0
22    0.0
23   -4.0
24    0.0
25    0.0
26    0.0
27    0.0
28    0.0
29    2.0
30    0.0
Name: IT EXPERIENCE, dtype: float64

In [ ]:
df['IT EXPERIENCE'].diff(periods=2) # current row - alternate value

In [ ]:
df['IT EXPERIENCE'].div(2) # divide by 2

0     0.0
1     3.0
2     0.0
3     0.0
4     0.0
5     0.0
6     0.0
7     0.0
8     0.0
9     0.0
10    0.0
11    0.0
12    0.0
13    0.5
14    0.0
15    0.0
16    0.0
17    0.0
18    0.0
19    0.0
20    0.0
21    2.0
22    0.0
23    0.0
24    0.0
25    0.0
26    0.0
27    0.0
28    0.0
29    1.0
30    0.0
Name: IT EXPERIENCE, dtype: float64

In [ ]:
df['IT EXPERIENCE'].min()

0

In [ ]:
df['IT EXPERIENCE'].max()

6

In [ ]:
df['IT EXPERIENCE'].mean()

np.float64(0.41935483870967744)

In [ ]:
df['IT EXPERIENCE'].median()

0.0

In [ ]:
df['IT EXPERIENCE'].mul(2)

0      0
1     12
2      0
3      0
4      0
5      0
6      0
7      0
8      0
9      0
10     0
11     0
12     0
13     2
14     0
15     0
16     0
17     0
18     0
19     0
20     0
21     8
22     0
23     0
24     0
25     0
26     0
27     0
28     0
29     4
30     0
Name: IT EXPERIENCE, dtype: int64

In [ ]:
df['IT EXPERIENCE'].sum()

np.int64(13)

In [ ]:
# without writing np.nan in where() also it will put NaN in the cell
df['IT EXPERIENCE'].where(df['IT EXPERIENCE']>=1)

In [ ]:
import numpy as np
df['IT EXPERIENCE'].where(df['IT EXPERIENCE']>=1,np.nan)
# if condition satisfied do nothing, else replace with np.nan
# here where(condition,other) is pandas version, if true do nothing, if false do other
# we have seen numpy.where(condition,true,false)

0     NaN
1     6.0
2     NaN
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
9     NaN
10    NaN
11    NaN
12    NaN
13    1.0
14    NaN
15    NaN
16    NaN
17    NaN
18    NaN
19    NaN
20    NaN
21    4.0
22    NaN
23    NaN
24    NaN
25    NaN
26    NaN
27    NaN
28    NaN
29    2.0
30    NaN
Name: IT EXPERIENCE, dtype: float64

In [ ]:
df

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
7,6/27/2025 9:05:20,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6
8,6/27/2025 9:05:44,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa
9,6/27/2025 9:05:46,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA
11,6/27/2025 9:06:07,KARLAPATI VENKATA JAYAVARDHAN,396,MADHIRA,DEGREE,BA.PROGRAMME,Data Science,0,8 LPA
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa
14,6/27/2025 9:06:44,M.Abhilash Naik,397,Narasaraopeta,BTech,EEE,Data Science,0,5 to 6 LPA
15,6/27/2025 9:06:59,mayank kumar singh,397,kirandul,b.com in buisness analytics,commerce,Data Science,0,5-8lpa
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA
18,6/27/2025 9:07:56,Akurala Harshitha,397,Hanamkonda,B.Tech,Data Science,Data Science,0,5-6 LPA
19,6/27/2025 9:08:04,Kattela Harshitha,397,Sangareddy,BTech,Computer Science and Data Science,Data Science,0,6 lakhs
20,6/27/2025 9:08:15,Naga Srinu Kala,396,Rajamundry,B.sc,B.sc Computer science,Data Science,0,5 - 6 LPA
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000
22,6/27/2025 9:08:50,Nishith T,396,Warangal,BTECH,COMPUTER SCIENCE AND ENGINEERING,Data Science,0,10-12
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA
24,6/27/2025 9:09:25,k uday kiran,396,kakinada,bsc(meiot),no,Data Science,0,5lp
25,6/27/2025 9:09:56,ETYALA MAHESH,396,Karimnagar,B.tech,Mining,Data Science,0,6 lpa
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa
27,6/27/2025 9:10:08,Sravani Errolla,396,"mupkal, nizamabad",bachelor of degree,computer science,Data Science,0,10 LPA Basic
28,6/27/2025 9:10:30,sai,396,Hyderabad,b.tech,information technology,Data Science,0,25 lpa
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA